In [1]:
import pandas as pd

df = pd.DataFrame(
    data=[
        ["Allen", 175, 22],
        ["Ted", 180, 25]
    ],
    columns=["Name", "Height", "Age"]
)

df_1 = pd.DataFrame(
    data=[
        ["Jake", 177, 28],
        ["Mary", 170, 24]
    ],
    columns=["Name", "Height", "Age"]
)

In [2]:
df.append(df_1)

/var/folders/bv/8bbkzq895db366kq27vw262r0000gn/T/ipykernel_71604/2998176055.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df.append(df_1)

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25
0   Jake     177   28
1   Mary     170   24

In [3]:
df

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25

In [4]:
df = df.append(df_1)
df

/var/folders/bv/8bbkzq895db366kq27vw262r0000gn/T/ipykernel_71604/2826674874.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df_1)

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25
0   Jake     177   28
1   Mary     170   24

In [5]:
df.reset_index()

   index   Name  Height  Age
0      0  Allen     175   22
1      1    Ted     180   25
2      0   Jake     177   28
3      1   Mary     170   24

In [6]:
df.reset_index(drop=True)

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25
2   Jake     177   28
3   Mary     170   24

In [7]:
df = df.reset_index(drop=True)
df

    Name  Height  Age
0  Allen     175   22
1    Ted     180   25
2   Jake     177   28
3   Mary     170   24